### **Brewfile**

# Brewfile: macOS setup automation

tap "homebrew/bundle"

# CLI Tools & Dev
brew "awscli"
brew "btop"
brew "docker"
brew "ffmpeg"
brew "git"
brew "fzf"
brew "node"
brew "npm"
brew "nvm"
brew "pipenv"
brew "pyenv"
brew "python"
brew "speedtest-cli"
brew "tmux"
brew "mas"

# Apps (casks)
cask "alfred"
cask "rectangle"
cask "karabiner-elements"
cask "monitorcontrol"
cask "lastpass"
cask "notion"
cask "spotify"
cask "vlc"
cask "whatsapp"
cask "telegram"
cask "discord"
cask "brave-browser"
cask "visual-studio-code"
cask "iterm2"
cask "postman"
cask "chromium"
cask "capcut"

# Mac App Store apps
mas "Amphetamine", id: 937984704
mas "Final Cut Pro", id: 424389933
